Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
    .logo-title {
      font-size: 13px;
      font-weight: 800;
      letter-spacing: 0.16em;
      background: linear-gradient(135deg, #ffffff 30%, rgba(255,255,255,0.6) 100%);
      -webkit-background-clip: text;
      -webkit-text-fill-color: transparent;
    }
    
    .connection-badge {
      font-size: 9px;
      font-weight: 700;
      letter-spacing: 0.08em;
      padding: 5px 10px;
      border-radius: 20px;
      background: rgba(16, 185, 129, 0.08);
      color: var(--accent-success);
      border: 1px solid rgba(16, 185, 129, 0.2);
      transition: all 0.3s ease;
    }
    /* Cards */
    .card {
      background: var(--card-bg);
      border: 1px solid var(--card-border);
      border-radius: 24px;
      padding: 20px;
      box-shadow: 0 10px 30px rgba(0, 0, 0, 0.25);
      backdrop-filter: blur(20px);
      -webkit-backdrop-filter: blur(20px);
      transition: border-color 0.3s ease;
    }
    
    .card-title {
      font-size: 10px;
      font-weight: 800;
      letter-spacing: 0.12em;
      color: var(--text-muted);
      text-transform: uppercase;
      margin-bottom: 14px;
    }
    /* Radar Section centerpiece */
    .radar-wrapper {
      position: relative;
      width: 200px;
      height: 200px;
      margin: 0 auto 16px;
    }
    
    #radar-canvas {
      display: block;
      background: transparent;
      width: 200px;
      height: 200px;
    }
    /* Sliding Mode Selector */
    .mode-selector {
      position: relative;
      display: flex;
      background: rgba(16, 18, 35, 0.7);
      border: 1px solid var(--card-border);
      border-radius: 18px;
      padding: 4px;
      overflow-x: auto;
      -webkit-overflow-scrolling: touch;
      scrollbar-width: none;
    }
    .mode-selector::-webkit-scrollbar { display: none; }
    
    .mode-tab {
      position: relative;
      flex: 1;
      background: none;
      border: none;
      color: var(--text-muted);
      padding: 12px 6px;
      font-family: inherit;
      font-size: 9px;
      font-weight: 700;
      letter-spacing: 0.08em;
      cursor: pointer;
      display: flex;
      align-items: center;
      justify-content: center;
      gap: 4px;
      z-index: 2;
      transition: color 0.3s ease;
    }
    
    .mode-tab.active {
      color: var(--text-main);
    }
    
    .tab-icon {
      width: 13px;
      height: 13px;
      fill: none;
      stroke: currentColor;
      stroke-width: 2.2;
    }
    
    .tab-glider {
      position: absolute;
      left: 4px;
      top: 4px;
      width: calc(100%/7 - 6px);
      height: calc(100% - 8px);
      background: linear-gradient(135deg, var(--accent-success) 0%, rgba(16, 185, 129, 0.8) 100%);
      border-radius: 14px;
      z-index: 1;
      transition: all 0.35s cubic-bezier(0.25, 1, 0.4, 1);
      box-shadow: 0 4px 12px var(--accent-success-glow);
    }
    
    .mode-selector.rc-active .tab-glider {
      transform: translateX(calc(100% + 4px));
      background: linear-gradient(135deg, var(--accent-primary) 0%, rgba(99, 102, 241, 0.8) 100%);
      box-shadow: 0 4px 12px var(--accent-primary-glow);
    }
    .mode-selector.gesture-active .tab-glider {
      transform: translateX(calc(200% + 8px));
      background: linear-gradient(135deg, var(--accent-gesture) 0%, rgba(6, 182, 212, 0.8) 100%);
      box-shadow: 0 4px 12px var(--accent-gesture-glow);
    }
    .mode-selector.follow-active .tab-glider {
      transform: translateX(calc(300% + 12px));
      background: linear-gradient(135deg, var(--accent-follow) 0%, rgba(168, 85, 247, 0.8) 100%);
      box-shadow: 0 4px 12px var(--accent-follow-glow);
    }
    .mode-selector.line-active .tab-glider {
      transform: translateX(calc(400% + 16px));
      background: linear-gradient(135deg, #eab308 0%, rgba(234, 179, 8, 0.8) 100%);
      box-shadow: 0 4px 12px rgba(234, 179, 8, 0.25);
    }
    .mode-selector.light-active .tab-glider {
      transform: translateX(calc(500% + 20px));
      background: linear-gradient(135deg, #f97316 0%, rgba(249, 115, 22, 0.8) 100%);
      box-shadow: 0 4px 12px rgba(249, 115, 22, 0.25);
    }
    .mode-selector.sound-active .tab-glider {
      transform: translateX(calc(600% + 24px));
      background: linear-gradient(135deg, #ec4899 0%, rgba(236, 72, 153, 0.8) 100%);
      box-shadow: 0 4px 12px rgba(236, 72, 153, 0.25);
    }
    /* Telemetry Panel */
    .metrics-container {
      display: grid;
      grid-template-columns: repeat(auto-fit, minmax(110px, 1fr));
      gap: 12px;
    }
    
    .metric-widget {
      background: rgba(30, 35, 60, 0.25);
      border: 1px solid rgba(255, 255, 255, 0.02);
      border-radius: 16px;
      padding: 12px 14px;
      display: flex;
      flex-direction: column;
      gap: 4px;
      position: relative;
      overflow: hidden;
    }
    
    .metric-icon-wrap {
      position: absolute;
      right: 10px;
      top: 10px;
      opacity: 0.05;
      color: var(--text-main);
    }
    
    .metric-icon-wrap svg {
      width: 26px;
      height: 26px;
      stroke: currentColor;
      stroke-width: 2;
      fill: none;
    }
    
    .metric-label {
      font-size: 8px;
      font-weight: 800;
      letter-spacing: 0.1em;
      color: var(--text-muted);
    }
    
    .metric-value {
      font-size: 16px;
      font-weight: 700;
      font-family: 'JetBrains Mono', monospace;
    }
    
    .gauge-bar-container {
      width: 100%;
      height: 3px;
      background: rgba(255, 255, 255, 0.06);
      border-radius: 2px;
      overflow: hidden;
      margin-top: 6px;
    }
    
    .gauge-bar {
      height: 100%;
      background: var(--accent-active);
      border-radius: 2px;
      transition: width 0.30s ease, background-color 0.30s ease;
    }
    
    .status-safe { color: var(--accent-success); }
    .status-warning { color: #f59e0b; }
    .status-danger { 
      color: var(--accent-danger); 
      animation: alert-flash 0.8s ease infinite alternate; 
    }
    
    @keyframes alert-flash {
      from { opacity: 0.5; }
      to { opacity: 1; }
    }
    /* Tab Pages */
    .panel-oa, .panel-rc, .panel-gesture, .panel-follow, .panel-line, .panel-light, .panel-sound {
      display: none;
    }
    
    .panel-oa.active, .panel-rc.active, .panel-gesture.active, .panel-follow.active,
    .panel-line.active, .panel-light.active, .panel-sound.active {
      display: block;
      animation: tab-switch-in 0.3s cubic-bezier(0.25, 1, 0.5, 1) forwards;
    }
    
    @keyframes tab-switch-in {
      from { opacity: 0; transform: translateY(6px); }
      to { opacity: 1; transform: translateY(0); }
    }
    
