Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
    .oa-status-msg {
      text-align: center;
      font-size: 11px;
      color: var(--text-muted);
      line-height: 1.6;
      padding: 10px 15px;
    }
    /* RC Controls Joystick Layout */
    .controls-layout {
      display: flex;
      flex-direction: column;
      gap: 20px;
    }
    
    .joystick-container {
      display: flex;
      flex-direction: column;
      align-items: center;
      gap: 8px;
    }
    
    .joystick-zone {
      width: 100%;
      height: 180px;
      display: flex;
      align-items: center;
      justify-content: center;
      position: relative;
      touch-action: none;
    }
    
    .joystick-base {
      width: 150px;
      height: 150px;
      background: rgba(30, 35, 60, 0.2);
      border: 1.5px dashed rgba(255, 255, 255, 0.08);
      border-radius: 50%;
      position: relative;
      display: flex;
      align-items: center;
      justify-content: center;
      box-shadow: inset 0 4px 12px rgba(0, 0, 0, 0.3);
    }
    
    .joystick-handle {
      width: 54px;
      height: 54px;
      background: radial-gradient(circle at 30% 30%, #ffffff 0%, var(--accent-active) 85%);
      border-radius: 50%;
      position: absolute;
      cursor: grab;
      box-shadow: 0 8px 20px rgba(0, 0, 0, 0.4), 0 0 15px var(--accent-active-glow);
      transition: background-color 0.3s ease;
      touch-action: none;
    }
    
    .joystick-handle:active {
      cursor: grabbing;
      background: radial-gradient(circle at 30% 30%, #ffffff 0%, #ffffff 100%);
      box-shadow: 0 4px 10px rgba(0,0,0,0.4), 0 0 25px #ffffff;
    }
    /* Sliders and Action Buttons */
    .actions-panel {
      display: flex;
      flex-direction: column;
      gap: 16px;
    }
    
    .btn-horn {
      width: 100%;
      padding: 14px;
      background: rgba(244, 63, 94, 0.08);
      border: 1px solid rgba(244, 63, 94, 0.2);
      border-radius: 16px;
      color: var(--accent-danger);
      font-family: inherit;
      font-size: 11px;
      font-weight: 700;
      letter-spacing: 0.08em;
      cursor: pointer;
      display: flex;
      align-items: center;
      justify-content: center;
      gap: 8px;
      outline: none;
      transition: all 0.15s ease;
    }
    
    .btn-horn svg {
      width: 16px;
      height: 16px;
      fill: none;
      stroke: currentColor;
      stroke-width: 2.2;
    }
    
    .btn-horn:active, .btn-horn.active {
      background: var(--accent-danger);
      border-color: var(--accent-danger);
      color: #ffffff;
      transform: scale(0.97);
      box-shadow: 0 0 16px var(--accent-danger-glow);
    }
    
    .slider-group {
      display: flex;
      flex-direction: column;
      gap: 6px;
    }
    
    .slider-header {
      display: flex;
      justify-content: space-between;
      align-items: center;
      padding: 0 2px;
    }
    
    .slider-title {
      display: flex;
      align-items: center;
      gap: 6px;
      font-size: 9px;
      font-weight: 800;
      letter-spacing: 0.08em;
      color: var(--text-muted);
    }
    
    .slider-icon {
      width: 13px;
      height: 13px;
      fill: none;
      stroke: currentColor;
      stroke-width: 2.2;
    }
    
    .slider-value {
      font-size: 11px;
      font-weight: 700;
      color: var(--accent-active);
      font-family: 'JetBrains Mono', monospace;
      transition: color 0.3s ease;
    }
    
    .range-input-wrap {
      padding: 4px 0;
    }
    
    input[type='range'] {
      -webkit-appearance: none;
      width: 100%;
      height: 5px;
      background: rgba(255, 255, 255, 0.07);
      border-radius: 4px;
      outline: none;
      border: none;
    }
    
    input[type='range']::-webkit-slider-thumb {
      -webkit-appearance: none;
      width: 18px;
      height: 18px;
      border-radius: 50%;
      background: var(--accent-active);
      box-shadow: 0 0 8px var(--accent-active-glow);
      cursor: pointer;
      border: 2.5px solid var(--bg-color);
      transition: transform 0.12s, background-color 0.12s, border-color 0.12s;
    }
    
    input[type='range']::-webkit-slider-thumb:hover {
      transform: scale(1.15);
    }
    
    input[type='range']::-webkit-slider-thumb:active {
      background: #ffffff;
      border-color: var(--accent-active);
      box-shadow: 0 0 12px #ffffff;
    }
  </style>
</head>
<body>
<div class='app-container theme-oa'>
  
  <!-- Top Header Deck -->
  <header class='header'>
    <div class='logo-area'>
      <span class='pulse-indicator'></span>
      <h1 class='logo-title'>GHOST DRIVE</h1>
    </div>
    <div class='connection-badge' id='conn-badge'>READY</div>
  </header>
  <!-- Radar centerpiece card -->
  <section class='card'>
    <h2 class='card-title'>ACTIVE TELEMETRY SCANNER</h2>
    <div class='radar-wrapper'>
      <canvas id='radar-canvas' width='200' height='200'></canvas>
    </div>
    <div class='metrics-container'>
      <!-- Distance Widget -->
      <div class='metric-widget'>
        <div class='metric-icon-wrap'>
          <svg viewBox='0 0 24 24'><path d='M12 22s8-4 8-10V5l-8-3-8 3v7c0 6 8 10 8 10z'/></svg>
        </div>
        <span class='metric-label'>LIDAR RANGE</span>
        <span class='metric-value' id='val-dist'>-- cm</span>
        <div class='gauge-bar-container'>
          <div class='gauge-bar' id='dist-gauge' style='width: 100%'></div>
        </div>
      </div>
      <!-- Cliff Widget -->
      <div class='metric-widget'>
        <div class='metric-icon-wrap'>
          <svg viewBox='0 0 24 24'><path d='M12 2L2 22h20L12 2zm0 14h.01M12 10v4'/></svg>
        </div>
        <span class='metric-label'>CLIFF SCAN</span>
        <span class='metric-value status-safe' id='val-cliff'>SAFE</span>
        <div class='gauge-bar-container'>
          <div class='gauge-bar' id='cliff-gauge' style='width: 100%'></div>
        </div>
      </div>
      <!-- Vector Widget -->
      <div class='metric-widget'>
        <div class='metric-icon-wrap'>
          <svg viewBox='0 0 24 24'><polygon points='12 2 22 8.5 22 15.5 12 22 2 15.5 2 8.5 12 2'/></svg>
        </div>
        <span class='metric-label'>VECTOR CHN</span>
        <span class='metric-value' id='val-cmd'>STOP</span>
        <div class='gauge-bar-container'>
          <div class='gauge-bar' id='vector-gauge' style='width: 100%'></div>
        </div>
      </div>
    </div>
  </section>
  
  <!-- Sliding Selector Tab -->
  <div class='mode-selector'>
    <button class='mode-tab active' id='tab-oa' onclick='changeMode("oa")'>
      <svg class='tab-icon' viewBox='0 0 24 24'><circle cx='12' cy='12' r='3'/><path d='M12 2v3M12 19v3M4.22 4.22l2.12 2.12M17.66 17.66l2.12 2.12M2 12h3M19 12h3M4.22 19.78l2.12-2.12M17.66 6.34l2.12-2.12'/></svg>
      <span>AUTO</span>
    </button>
    <button class='mode-tab' id='tab-rc' onclick='changeMode("rc")'>
      <svg class='tab-icon' viewBox='0 0 24 24'><rect x='2' y='7' width='20' height='14' rx='3'/><path d='M12 7V3M8 3h8'/><line x1='9' y1='14' x2='9' y2='14'/><line x1='6' y1='14' x2='12' y2='14'/><line x1='9' y1='11' x2='9' y2='17'/><circle cx='15' cy='14' r='1'/></svg>
      <span>RC</span>
    </button>
    <button class='mode-tab' id='tab-gesture' onclick='changeMode("gesture")'>
      <svg class='tab-icon' viewBox='0 0 24 24'><rect x='5' y='2' width='14' height='20' rx='2' ry='2'/><line x1='12' y1='18' x2='12.01' y2='18'/><path d='M17 6c2 1 3 3 3 5s-1 4-3 5'/><path d='M7 6c-2 1-3 3-3 5s1 4 3 5'/></svg>
      <span>TILT</span>
    </button>
    <button class='mode-tab' id='tab-follow' onclick='changeMode("follow")'>
      <svg class='tab-icon' viewBox='0 0 24 24'><path d='M16 21v-2a4 4 0 0 0-4-4H6a4 4 0 0 0-4 4v2'/><circle cx='9' cy='7' r='4'/><path d='M22 9l-3 3 3 3'/></svg>
      <span>FOLLOW</span>
    </button>
    <button class='mode-tab' id='tab-line' onclick='changeMode("line")'>
      <svg class='tab-icon' viewBox='0 0 24 24'><path d='M3 12h18M3 6l6 6-6 6M21 6l-6 6 6 6'/></svg>
      <span>LINE</span>
    </button>
    <button class='mode-tab' id='tab-light' onclick='changeMode("light")'>
      <svg class='tab-icon' viewBox='0 0 24 24'><circle cx='12' cy='12' r='4'/><path d='M12 2v2M12 20v2M4.93 4.93l1.41 1.41M17.66 17.66l1.41 1.41M2 12h2M20 12h2M6.34 17.66l-1.41 1.41M19.07 4.93l-1.41 1.41'/></svg>
      <span>LIGHT</span>
    </button>
    <button class='mode-tab' id='tab-sound' onclick='changeMode("sound")'>
      <svg class='tab-icon' viewBox='0 0 24 24'><path d='M12 1a3 3 0 0 0-3 3v8a3 3 0 0 0 6 0V4a3 3 0 0 0-3-3z'/><path d='M19 10v2a7 7 0 0 1-14 0v-2M12 19v4M8 23h8'/></svg>
      <span>SOUND</span>
    </button>
    <div class='tab-glider'></div>
  </div>
  
  <!-- Autonomous Tab Page -->
  <section class='card panel-oa active' id='panel-oa'>
    <h2 class='card-title'>AUTONOMOUS NAVIGATOR</h2>
    <div class='oa-status-msg'>
      Car running in autonomous safety mode. Reduced speeds engaged for maximum reaction windows. Scans will run dynamically at path obstructions.
    </div>
  </section>
  
  <!-- Manual Tab Page -->
  <section class='card panel-rc' id='panel-rc'>
    <div class='controls-layout'>
      <!-- Interactive Joystick Controller -->
      <div class='joystick-container'>
        <h2 class='card-title'>360 VECTOR JOYSTICK</h2>
        <div class='joystick-zone'>
          <div class='joystick-base'>
            <div class='joystick-handle' id='joy-handle'></div>
          </div>
        </div>
      </div>
      
      <!-- Range sliders & horn button -->
      <div class='actions-panel'>
        <button class='btn-horn' id='btn-horn'>
          <svg viewBox='0 0 24 24'><path d='M11 5L6 9H2v6h4l5 4V5z'/><path d='M19.07 4.93a10 10 0 0 1 0 14.14'/><path d='M15.54 8.46a5 5 0 0 1 0 7.07'/></svg>
          <span>TRIGGER HORN</span>
        </button>
        
