Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
        <!-- Speed Limit Slider -->
        <div class='slider-group'>
          <div class='slider-header'>
            <div class='slider-title'>
              <svg class='slider-icon' viewBox='0 0 24 24'><polygon points='13 2 3 14 12 14 11 22 21 10 12 10 13 2'/></svg>
              <span>RC DRIVE VELOCITY</span>
            </div>
            <span class='slider-value' id='val-speed'>78%</span>
          </div>
          <div class='range-input-wrap'>
            <input type='range' id='slide-speed' min='20' max='100' value='78'>
          </div>
        </div>
        
        <!-- Camera Servo Angle Slider -->
        <div class='slider-group'>
          <div class='slider-header'>
            <div class='slider-title'>
              <svg class='slider-icon' viewBox='0 0 24 24'><path d='M1 12s4-8 11-8 11 8 11 8-4 8-11 8-11-8-11-8z'/><circle cx='12' cy='12' r='3'/></svg>
              <span>RADAR DECK SERVO</span>
            </div>
            <span class='slider-value' id='val-servo'>90°</span>
          </div>
          <div class='range-input-wrap'>
            <input type='range' id='slide-servo' min='0' max='180' value='90'>
          </div>
        </div>
      </div>
    </div>
  </section>

  <!-- Gesture Tab Page -->
  <section class='card panel-gesture' id='panel-gesture'>
    <h2 class='card-title'>IMU GESTURE CONTROLLER</h2>
    <div class="joystick-container">
      <div class="imu-visualizer" style="display: flex; justify-content: center; margin: 10px 0; width: 100%;">
        <canvas id="imu-canvas" width="140" height="140" style="background: transparent; border-radius: 50%; display: block;"></canvas>
      </div>
      <div style="display: grid; grid-template-columns: 1fr 1fr; gap: 12px; width: 100%; text-align: center; margin-bottom: 16px;">
        <div class="metric-widget" style="padding: 10px;">
          <span class="metric-label">PITCH TILT</span>
          <span class="metric-value" id="val-pitch">0°</span>
        </div>
        <div class="metric-widget" style="padding: 10px;">
          <span class="metric-label">ROLL TILT</span>
          <span class="metric-value" id="val-roll">0°</span>
        </div>
      </div>
      <button class="btn-horn" id="btn-imu-toggle" onclick="requestOrientationPermission()" style="background: rgba(6, 182, 212, 0.08); border-color: rgba(6, 182, 212, 0.2); color: var(--accent-gesture);">
        START TILT STEERING
      </button>
    </div>
  </section>

  <!-- Follow Tab Page -->
  <section class='card panel-follow' id='panel-follow'>
    <h2 class='card-title'>HUMAN TARGET FOLLOWER</h2>
    <div class="oa-status-msg" style="margin-bottom: 16px;">
      The car will dynamically seek out a human at a close distance range (15cm to 50cm).
      The scanning deck tracks the target, steering and driving the car to maintain its distance.
    </div>
    <div class="metrics-container" style="grid-template-columns: 1fr;">
      <div class="metric-widget" style="align-items: center; padding: 20px;">
        <span class="metric-label">TRACKED TARGET DISTANCE</span>
        <span class="metric-value" id="val-follow-dist" style="font-size: 24px; color: var(--accent-follow);">STANDBY</span>
        <div class="gauge-bar-container" style="width: 80%; margin-top: 10px;">
          <div class="gauge-bar" id="follow-gauge" style="width: 0%; background: var(--accent-follow);"></div>
        </div>
      </div>
    </div>
  </section>

  <!-- Line Follow Tab Page -->
  <section class='card panel-line' id='panel-line'>
    <h2 class='card-title'>LINE FOLLOWER</h2>
    <div class='oa-status-msg' style='margin-bottom:16px;'>
      3× TCRT5000 IR sensors track a dark line on a light surface.<br>
      The car steers left or right to keep the center sensor on the line.
    </div>
    <div class='metrics-container'>
      <div class='metric-widget' style='text-align:center;'>
        <span class='metric-label'>LEFT SENSOR</span>
        <span class='metric-value' id='lf-l' style='color:var(--accent-active);'>—</span>
      </div>
      <div class='metric-widget' style='text-align:center;'>
        <span class='metric-label'>CENTER</span>
        <span class='metric-value' id='lf-c' style='color:var(--accent-active);'>—</span>
      </div>
      <div class='metric-widget' style='text-align:center;'>
        <span class='metric-label'>RIGHT SENSOR</span>
        <span class='metric-value' id='lf-r' style='color:var(--accent-active);'>—</span>
      </div>
    </div>
  </section>

  <!-- Light Control Tab Page -->
  <section class='card panel-light' id='panel-light'>
    <h2 class='card-title'>LIGHT CONTROL</h2>
    <div class='oa-status-msg' style='margin-bottom:16px;'>
      Two LDRs (left &amp; right) measure ambient brightness.
      The car autonomously steers toward the brighter light source.
    </div>
    <div class='metrics-container'>
      <div class='metric-widget'>
        <span class='metric-label'>LEFT LDR</span>
        <span class='metric-value' id='ldr-l'>—</span>
        <div class='gauge-bar-container'><div class='gauge-bar' id='ldr-l-bar' style='width:50%'></div></div>
      </div>
      <div class='metric-widget'>
        <span class='metric-label'>RIGHT LDR</span>
        <span class='metric-value' id='ldr-r'>—</span>
        <div class='gauge-bar-container'><div class='gauge-bar' id='ldr-r-bar' style='width:50%'></div></div>
      </div>
    </div>
  </section>

  <!-- Sound Control Tab Page -->
  <section class='card panel-sound' id='panel-sound'>
    <h2 class='card-title'>SOUND CONTROL</h2>
    <div class='oa-status-msg' style='margin-bottom:16px;'>
      Clap or make a loud sound to toggle driving on/off.
      The microphone listens for amplitude spikes above the threshold.
    </div>
    <div class='metrics-container' style='grid-template-columns:1fr;'>
      <div class='metric-widget' style='align-items:center;padding:20px;'>
        <span class='metric-label'>MIC AMPLITUDE</span>
        <span class='metric-value' id='snd-amp' style='font-size:24px;color:var(--accent-active);'>—</span>
        <div class='gauge-bar-container' style='width:80%;margin-top:10px;'>
          <div class='gauge-bar' id='snd-bar' style='width:0%;background:var(--accent-active);'></div>
        </div>
      </div>
      <div class='metric-widget' style='text-align:center;'>
        <span class='metric-label'>DRIVE STATE</span>
        <span class='metric-value' id='snd-state' style='color:var(--text-muted);'>STANDBY</span>
      </div>
    </div>
  </section>

