Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
</div>
<script>
  let activeCmd = 'S';
  let socket;
  let imuActive = false;
  let lastGestureTime = 0;
  
  // Custom throttle to prevent ESP32 network starvation
  const throttle = (func, limit) => {
    let inThrottle;
    return (...args) => {
      const context = this;
      if (!inThrottle) {
        func.apply(context, args);
        inThrottle = true;
        setTimeout(() => inThrottle = false, limit);
      }
    }
  };
  
  // WebSockets setup
  const initWebSocket = () => {
    const wsUrl = 'ws://' + window.location.hostname + ':81/';
    socket = new WebSocket(wsUrl);
    socket.onopen = () => {
      const badge = document.getElementById('conn-badge');
      badge.textContent = 'CONNECTED';
      badge.style.background = 'rgba(16, 185, 129, 0.08)';
      badge.style.color = 'var(--accent-success)';
      badge.style.borderColor = 'rgba(16, 185, 129, 0.2)';
    };
    socket.onclose = () => {
      const badge = document.getElementById('conn-badge');
      badge.textContent = 'OFFLINE';
      badge.style.background = 'rgba(244, 63, 94, 0.08)';
      badge.style.color = 'var(--accent-danger)';
      badge.style.borderColor = 'rgba(244, 63, 94, 0.2)';
      setTimeout(initWebSocket, 2000);
    };
    socket.onmessage = (event) => {
      try {
        const data = JSON.parse(event.data);
        updateTelemetryUI(data);
      } catch(e) {}
    };
  };
  
  // Primary WS communication with HTTP fallbacks
  const sendSpeed = throttle((val) => {
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('speed:' + val);
    } else {
      fetch('/speed?v=' + val).catch(() => {});
    }
  }, 100);
  
  const sendServo = throttle((val) => {
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('servo:' + val);
    } else {
      fetch('/servo?a=' + val).catch(() => {});
    }
  }, 80);
  
  const sendCmd = (cmd) => {
    if (cmd !== activeCmd) {
      activeCmd = cmd;
      if (socket && socket.readyState === WebSocket.OPEN) {
        socket.send('cmd:' + cmd);
      } else {
        fetch('/cmd?d=' + cmd).catch(() => {});
      }
      const names = { F: 'FORWARD', B: 'REVERSE', L: 'LEFT', R: 'RIGHT', FL: 'FWD-LEFT', FR: 'FWD-RIGHT', BL: 'REV-LEFT', BR: 'REV-RIGHT', S: 'STOP' };
      document.getElementById('val-cmd').textContent = names[cmd] || 'STOP';
      
      const vGauge = document.getElementById('vector-gauge');
      if (cmd === 'S') {
        vGauge.style.width = '20%';
        vGauge.style.background = 'var(--text-muted)';
      } else {
        vGauge.style.width = '100%';
        vGauge.style.background = 'var(--accent-active)';
      }
    }
  };
  
  const sendGestureCmd = (cmd, speed) => {
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('g:' + cmd + ':' + speed);
    }
  };
  
  // Virtual Joystick Logic
  const handle = document.getElementById('joy-handle');
  const joyBase = handle.parentElement;
  let isDragging = false;
  let startX = 0, startY = 0;
  const maxDistance = 45; // max displacement boundary (px)
  
  const initJoystick = () => {
    joyBase.addEventListener('pointerdown', (e) => {
      e.preventDefault();
      isDragging = true;
      joyBase.setPointerCapture(e.pointerId);
      
      const rect = joyBase.getBoundingClientRect();
      startX = rect.left + rect.width / 2;
      startY = rect.top + rect.height / 2;
      
      updateJoyPos(e.clientX, e.clientY);
    });
    
    joyBase.addEventListener('pointermove', (e) => {
      if (!isDragging) return;
      e.preventDefault();
      updateJoyPos(e.clientX, e.clientY);
    });
    
    const endDrag = (e) => {
      if (!isDragging) return;
      isDragging = false;
      joyBase.releasePointerCapture(e.pointerId);
      
      handle.style.transform = 'translate(0px, 0px)';
      sendCmd('S');
    };
    
    joyBase.addEventListener('pointerup', endDrag);
    joyBase.addEventListener('pointercancel', endDrag);
  };
  
  const updateJoyPos = (clientX, clientY) => {
    let dx = clientX - startX;
    let dy = clientY - startY;
    
    const distance = Math.sqrt(dx * dx + dy * dy);
    if (distance > maxDistance) {
      dx = (dx / distance) * maxDistance;
      dy = (dy / distance) * maxDistance;
    }
    
    handle.style.transform = `translate(${dx}px, ${dy}px)`;
    
    const nx = dx / maxDistance;
    const ny = -dy / maxDistance;
    
    let cmd = 'S';
    const deadzone = 0.35;
    
    if (Math.abs(nx) < deadzone && Math.abs(ny) < deadzone) {
      cmd = 'S';
    } else {
      const angle = Math.atan2(ny, nx) * 180 / Math.PI;
      
      if (angle >= -22.5 && angle < 22.5) {
        cmd = 'R';
      } else if (angle >= 22.5 && angle < 67.5) {
        cmd = 'FR';
      } else if (angle >= 67.5 && angle < 112.5) {
        cmd = 'F';
      } else if (angle >= 112.5 && angle < 157.5) {
        cmd = 'FL';
      } else if (angle >= 157.5 || angle < -157.5) {
        cmd = 'L';
      } else if (angle >= -157.5 && angle < -112.5) {
        cmd = 'BL';
      } else if (angle >= -112.5 && angle < -67.5) {
        cmd = 'B';
      } else if (angle >= -67.5 && angle < -22.5) {
        cmd = 'BR';
      }
    }
    sendCmd(cmd);
  };
  initJoystick();
  
  // Horn Button Touch/Pointer listeners
  const horn = document.getElementById('btn-horn');
  const hornStart = (e) => {
    e.preventDefault();
    horn.classList.add('active');
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('horn:1');
    } else {
      fetch('/horn?on=1').catch(() => {});
    }
  };
  
  const hornEnd = (e) => {
    e.preventDefault();
    horn.classList.remove('active');
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('horn:0');
    } else {
      fetch('/horn?on=0').catch(() => {});
    }
  };
  
  horn.addEventListener('pointerdown', hornStart);
  horn.addEventListener('pointerup', hornEnd);
  horn.addEventListener('pointerleave', hornEnd);
  
  // Sliders Input Bindings
  const speedSlider = document.getElementById('slide-speed');
  const speedVal = document.getElementById('val-speed');
  speedSlider.addEventListener('input', () => {
    const txt = speedSlider.value + '%';
    speedVal.textContent = txt;
    sendSpeed(speedSlider.value);
  });
  
  speedSlider.addEventListener('change', () => {
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('speed:' + speedSlider.value);
    } else {
      fetch('/speed?v=' + speedSlider.value).catch(() => {});
    }
  });
  
  const servoSlider = document.getElementById('slide-servo');
  const servoVal = document.getElementById('val-servo');
  servoSlider.addEventListener('input', () => {
    const txt = servoSlider.value + '°';
    servoVal.textContent = txt;
    sendServo(servoSlider.value);
  });
  
