Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
  const servoSliderChange = () => {
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('servo:' + servoSlider.value);
    } else {
      fetch('/servo?a=' + servoSlider.value).catch(() => {});
    }
  };
  servoSlider.addEventListener('change', servoSliderChange);
  
  // Mode Selection Tabs Switcher
  const changeMode = (mode) => {
    if (mode !== 'gesture' && imuActive) {
      stopOrientationListener();
    }
    syncModeTab(mode);
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('mode:' + mode);
    } else {
      fetch('/set?mode=' + mode).catch(() => {});
    }
  };
  
  const syncModeTab = (mode) => {
    const container = document.querySelector('.app-container');
    const selector = document.querySelector('.mode-selector');
    const tabs = ['oa', 'rc', 'gesture', 'follow', 'line', 'light', 'sound'];
    
    tabs.forEach(t => {
      document.getElementById('tab-' + t).classList.remove('active');
      document.getElementById('panel-' + t).classList.remove('active');
    });
    
    document.getElementById('tab-' + mode).classList.add('active');
    document.getElementById('panel-' + mode).classList.add('active');
    
    // Scroll active tab into view
    const activeTab = document.getElementById('tab-' + mode);
    if (activeTab) activeTab.scrollIntoView({ behavior: 'smooth', block: 'nearest', inline: 'center' });
    
    selector.className = 'mode-selector';
    if (mode === 'rc') {
      selector.classList.add('rc-active');
      container.className = 'app-container theme-rc';
    } else if (mode === 'gesture') {
      selector.classList.add('gesture-active');
      container.className = 'app-container theme-gesture';
      drawImuIndicator(0, 0);
    } else if (mode === 'follow') {
      selector.classList.add('follow-active');
      container.className = 'app-container theme-follow';
    } else if (mode === 'line') {
      selector.classList.add('line-active');
      container.className = 'app-container theme-line';
    } else if (mode === 'light') {
      selector.classList.add('light-active');
      container.className = 'app-container theme-light';
    } else if (mode === 'sound') {
      selector.classList.add('sound-active');
      container.className = 'app-container theme-sound';
    } else {
      container.className = 'app-container theme-oa';
    }
  };
  
  // Telemetry updates
  const updateTelemetryUI = (data) => {
    // Distance Lidar
    const distVal = document.getElementById('val-dist');
    const distBar = document.getElementById('dist-gauge');
    if (data.dist >= 999) {
      distVal.textContent = 'CLEAR';
      distVal.className = 'metric-value status-safe';
      distBar.style.width = '100%';
      distBar.style.background = 'var(--accent-success)';
    } else {
      distVal.textContent = data.dist + ' cm';
      const pct = Math.min(Math.max(data.dist, 0), 100);
      distBar.style.width = pct + '%';
      if (data.dist > 50) {
        distVal.className = 'metric-value status-safe';
        distBar.style.background = 'var(--accent-success)';
      } else if (data.dist > 30) {
        distVal.className = 'metric-value status-warning';
        distBar.style.background = '#f59e0b';
      } else {
        distVal.className = 'metric-value status-danger';
        distBar.style.background = 'var(--accent-danger)';
      }
    }
    
    // Cliff IR
    const cliffVal = document.getElementById('val-cliff');
    const cliffBar = document.getElementById('cliff-gauge');
    if (data.ir < 1600) {
      cliffVal.textContent = 'CLIFF!';
      cliffVal.className = 'metric-value status-danger';
      cliffBar.style.width = '20%';
      cliffBar.style.background = 'var(--accent-danger)';
    } else {
      cliffVal.textContent = 'SAFE';
      cliffVal.className = 'metric-value status-safe';
      cliffBar.style.width = '100%';
      cliffBar.style.background = 'var(--accent-success)';
    }
    
    // Follow Mode telemetries
    const followVal = document.getElementById('val-follow-dist');
    const followBar = document.getElementById('follow-gauge');
    if (data.mode === 'follow') {
      if (data.dist >= 999) {
        followVal.textContent = 'SEEKING...';
        followVal.style.color = 'var(--text-muted)';
        followBar.style.width = '0%';
      } else {
        followVal.textContent = data.dist + ' cm';
        followVal.style.color = 'var(--accent-active)';
        const fPct = Math.min(Math.max((data.dist - 15) / (50 - 15) * 100, 0), 100);
        followBar.style.width = fPct + '%';
      }
    }
    
    // Update radar sweeps target trackers
    currentAngle = data.angle;
    
    // Push target readings to decay array
    addRadarTarget(data.angle, data.dist);
    addRadarTarget(150, data.dL);
    addRadarTarget(90, data.dC);
    addRadarTarget(30, data.dR);
    
    // Extended sensor telemetry (line follower, light, sound)
    if (data.lfL !== undefined) {
      const col = 'var(--accent-active)';
      document.getElementById('lf-l').textContent = data.lfL ? 'LINE' : '---';
      document.getElementById('lf-c').textContent = data.lfC ? 'LINE' : '---';
      document.getElementById('lf-r').textContent = data.lfR ? 'LINE' : '---';
    }
    if (data.ldrL !== undefined) {
      document.getElementById('ldr-l').textContent = data.ldrL;
      document.getElementById('ldr-r').textContent = data.ldrR;
      document.getElementById('ldr-l-bar').style.width = (data.ldrL / 40.95) + '%';
      document.getElementById('ldr-r-bar').style.width = (data.ldrR / 40.95) + '%';
    }
    if (data.sndAmp !== undefined) {
      document.getElementById('snd-amp').textContent = data.sndAmp;
      document.getElementById('snd-bar').style.width = Math.min(data.sndAmp / 4, 100) + '%';
      document.getElementById('snd-state').textContent = data.sndOn ? 'DRIVING' : 'STANDBY';
      document.getElementById('snd-state').style.color = data.sndOn ? 'var(--accent-active)' : 'var(--text-muted)';
    }
    // Sync mode tab selection
    const tabs = ['oa', 'rc', 'gesture', 'follow', 'line', 'light', 'sound'];
    const activeTab = tabs.find(t => document.getElementById('tab-' + t).classList.contains('active'));
    if (data.mode !== activeTab) {
      syncModeTab(data.mode);
    }
  };
  
  const fetchTelemetry = () => {
    fetch('/status')
      .then(res => res.json())
      .then(data => {
        const badge = document.getElementById('conn-badge');
        badge.textContent = 'CONNECTED';
        badge.style.background = 'rgba(16, 185, 129, 0.08)';
        badge.style.color = 'var(--accent-success)';
        badge.style.borderColor = 'rgba(16, 185, 129, 0.2)';
        updateTelemetryUI(data);
      })
      .catch(() => {
        if (!socket || socket.readyState !== WebSocket.OPEN) {
          const badge = document.getElementById('conn-badge');
          badge.textContent = 'OFFLINE';
          badge.style.background = 'rgba(244, 63, 94, 0.08)';
          badge.style.color = 'var(--accent-danger)';
          badge.style.borderColor = 'rgba(244, 63, 94, 0.2)';
        }
      });
  };
  
  // Canvas radar renderer logic
  const canvas = document.getElementById('radar-canvas');
  const ctx = canvas.getContext('2d');
  const cx = canvas.width / 2;
  const cy = canvas.height / 2;
  const maxR = 90; // maximum range scale radius (px)
  
  let currentAngle = 90;
  let targetSpots = []; // holds target markers {angle, dist, life}
  
  const addRadarTarget = (angle, dist) => {
    if (dist <= 0 || dist >= 100) return;
    const radAngle = angle;
    const existing = targetSpots.find(t => Math.abs(t.angle - radAngle) < 15);
    if (existing) {
      existing.dist = dist;
      existing.life = 1.0;
    } else {
      targetSpots.push({ angle: radAngle, dist: dist, life: 1.0 });
    }
  };
  
