Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
  const renderRadar = () => {
    ctx.clearRect(0, 0, canvas.width, canvas.height);
    
    // Outer scope radial backing
    ctx.beginPath();
    ctx.arc(cx, cy, maxR, 0, 2 * Math.PI);
    ctx.fillStyle = 'rgba(16, 185, 129, 0.012)';
    ctx.fill();
    
    // Grid circles
    ctx.strokeStyle = 'rgba(16, 185, 129, 0.12)';
    ctx.lineWidth = 1;
    ctx.setLineDash([4, 4]);
    [30, 60, 90].forEach(rVal => {
      ctx.beginPath();
      ctx.arc(cx, cy, (rVal / 100) * maxR, 0, 2 * Math.PI);
      ctx.stroke();
    });
    
    // Crosshairs lines
    ctx.setLineDash([]);
    ctx.strokeStyle = 'rgba(16, 185, 129, 0.06)';
    ctx.beginPath();
    ctx.moveTo(cx - maxR, cy);
    ctx.lineTo(cx + maxR, cy);
    ctx.moveTo(cx, cy - maxR);
    ctx.lineTo(cx, cy + maxR);
    ctx.stroke();
    
    // Field of view lines (Left and Right bounds: 30deg and 150deg)
    ctx.strokeStyle = 'rgba(16, 185, 129, 0.04)';
    [30, 150].forEach(deg => {
      const rad = deg * Math.PI / 180;
      ctx.beginPath();
      ctx.moveTo(cx, cy);
      ctx.lineTo(cx + maxR * Math.cos(rad), cy - maxR * Math.sin(rad));
      ctx.stroke();
    });
    
    // Dynamic active theme color determination
    const container = document.querySelector('.app-container');
    let rgbColor = '16, 185, 129';
    if (container.classList.contains('theme-rc')) rgbColor = '99, 102, 241';
    else if (container.classList.contains('theme-gesture')) rgbColor = '6, 182, 212';
    else if (container.classList.contains('theme-follow')) rgbColor = '168, 85, 247';
    else if (container.classList.contains('theme-line')) rgbColor = '234, 179, 8';
    else if (container.classList.contains('theme-light')) rgbColor = '249, 115, 22';
    else if (container.classList.contains('theme-sound')) rgbColor = '236, 72, 153';
    
    // Sensor flashlight sweeping cone (16deg width)
    const beamAngle = currentAngle * Math.PI / 180;
    const beamGrad = ctx.createRadialGradient(cx, cy, 0, cx, cy, maxR);
    beamGrad.addColorStop(0, `rgba(${rgbColor}, 0.2)`);
    beamGrad.addColorStop(0.3, `rgba(${rgbColor}, 0.06)`);
    beamGrad.addColorStop(1, `rgba(${rgbColor}, 0)`);
    
    ctx.fillStyle = beamGrad;
    ctx.beginPath();
    ctx.moveTo(cx, cy);
    ctx.arc(cx, cy, maxR, -beamAngle - (8 * Math.PI/180), -beamAngle + (8 * Math.PI/180));
    ctx.closePath();
    ctx.fill();
    
    // Sweeping beam centerline indicator
    ctx.strokeStyle = `rgba(${rgbColor}, 0.4)`;
    ctx.lineWidth = 1.5;
    ctx.beginPath();
    ctx.moveTo(cx, cy);
    ctx.lineTo(cx + maxR * Math.cos(beamAngle), cy - maxR * Math.sin(beamAngle));
    ctx.stroke();
    
    // Decay update & draw warning markers
    targetSpots.forEach(t => t.life -= 0.012);
    targetSpots = targetSpots.filter(t => t.life > 0);
    targetSpots.forEach(t => {
      const r = (t.dist / 100) * maxR;
      const rAngle = t.angle * Math.PI / 180;
      const tx = cx + r * Math.cos(rAngle);
      const ty = cy - r * Math.sin(rAngle);
      
      // Warning obstacle glow ring
      ctx.beginPath();
      ctx.arc(tx, ty, 4, 0, 2 * Math.PI);
      ctx.fillStyle = `rgba(244, 63, 94, ${t.life})`;
      ctx.shadowColor = '#f43f5e';
      ctx.shadowBlur = 8;
      ctx.fill();
      ctx.shadowBlur = 0;
      
      // Pulsing outer halo rings
      ctx.beginPath();
      ctx.arc(tx, ty, 12 * (1 - t.life), 0, 2 * Math.PI);
      ctx.strokeStyle = `rgba(244, 63, 94, ${t.life * 0.45})`;
      ctx.lineWidth = 1.2;
      ctx.stroke();
    });
    requestAnimationFrame(renderRadar);
  };
  
  // IMU canvas indicator bubble drawing
  const drawImuIndicator = (pitch, roll) => {
    const imuCanvas = document.getElementById('imu-canvas');
    if (!imuCanvas) return;
    const imuCtx = imuCanvas.getContext('2d');
    const icx = imuCanvas.width / 2;
    const icy = imuCanvas.height / 2;
    const maxOffset = 50;
    
    imuCtx.clearRect(0, 0, imuCanvas.width, imuCanvas.height);
    
    // Draw outer circle
    imuCtx.strokeStyle = 'rgba(6, 182, 212, 0.15)';
    imuCtx.lineWidth = 2;
    imuCtx.beginPath();
    imuCtx.arc(icx, icy, maxOffset, 0, 2 * Math.PI);
    imuCtx.stroke();
    
    // Draw crosshairs
    imuCtx.strokeStyle = 'rgba(6, 182, 212, 0.05)';
    imuCtx.beginPath();
    imuCtx.moveTo(icx - maxOffset, icy);
    imuCtx.lineTo(icx + maxOffset, icy);
    imuCtx.moveTo(icx, icy - maxOffset);
    imuCtx.lineTo(icx, icy + maxOffset);
    imuCtx.stroke();
    
    // Calculate bubble position based on pitch/roll (clamp between -45 and 45)
    const px = Math.min(Math.max(roll / 45, -1), 1) * maxOffset;
    const py = Math.min(Math.max(-pitch / 45, -1), 1) * maxOffset;
    
    // Draw bubble
    imuCtx.beginPath();
    imuCtx.arc(icx + px, icy + py, 10, 0, 2 * Math.PI);
    imuCtx.fillStyle = 'var(--accent-active)';
    imuCtx.shadowColor = 'var(--accent-active)';
    imuCtx.shadowBlur = 10;
    imuCtx.fill();
    imuCtx.shadowBlur = 0;
  };
  
  // Process device orientation and send packets to server
  const processOrientationData = (pitch, roll) => {
    const now = Date.now();
    if (now - lastGestureTime < 100) return;
    lastGestureTime = now;
    
    let cmd = 'S';
    const deadzone = 10;
    
    const absPitch = Math.abs(pitch);
    const absRoll = Math.abs(roll);
    
    if (absPitch > deadzone || absRoll > deadzone) {
      if (pitch > deadzone && roll > deadzone) cmd = 'FR';
      else if (pitch > deadzone && roll < -deadzone) cmd = 'FL';
      else if (pitch < -deadzone && roll > deadzone) cmd = 'BR';
      else if (pitch < -deadzone && roll < -deadzone) cmd = 'BL';
      else if (pitch > deadzone) cmd = 'F';
      else if (pitch < -deadzone) cmd = 'B';
      else if (roll > deadzone) cmd = 'R';
      else if (roll < -deadzone) cmd = 'L';
    }
    
    let speed = 0;
    if (cmd !== 'S') {
      const maxTilt = Math.min(Math.max(Math.max(absPitch, absRoll), deadzone), 40);
      const pct = (maxTilt - deadzone) / (40 - deadzone);
      const limitPct = parseInt(document.getElementById('slide-speed').value) / 100.0;
      speed = Math.round(350 + (pct * (800 - 350) * limitPct));
    }
    
