Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
  // Start WebSocket Server
  webSocket.begin();
  webSocket.onEvent(webSocketEvent);
  
  beep(100);
  Serial.println("System initialized. HTTP & WebSocket servers running.");
}
// ─────────────────────────────────────────────────────────────
//  LOOP
// ─────────────────────────────────────────────────────────────
void loop() {
  server.handleClient();   // Always handle incoming HTTP requests
  webSocket.loop();        // Keep the WebSocket server listening
  
  // Update servo angle safely in loop context
  if (carMode == MODE_OA) {
    aimServo(TURN_ANGLE_C, false);
  } else if (carMode == MODE_RC || carMode == MODE_GESTURE) {
    aimServo(rcServoAngle, false);
  }
  
  // Broadcast WebSocket telemetry at 150ms intervals
  static unsigned long lastWsTelemetry = 0;
  if (millis() - lastWsTelemetry > 150) {
    lastWsTelemetry = millis();
    String modeStr = "oa";
    if (carMode == MODE_RC) modeStr = "rc";
    else if (carMode == MODE_GESTURE) modeStr = "gesture";
    else if (carMode == MODE_FOLLOW) modeStr = "follow";
    else if (carMode == MODE_LINE) modeStr = "line";
    else if (carMode == MODE_LIGHT) modeStr = "light";
    else if (carMode == MODE_SOUND) modeStr = "sound";
    
    String json = "{";
    json += "\"mode\":\"" + modeStr + "\",";
    json += "\"dist\":" + String(lastDistance) + ",";
    json += "\"angle\":" + String(currentServoAngle) + ",";
    json += "\"ir\":" + String(lastIR) + ",";
    json += "\"dL\":" + String(dL_dist) + ",";
    json += "\"dC\":" + String(dC_dist) + ",";
    json += "\"dR\":" + String(dR_dist);
    // Extended sensor data
    if (carMode == MODE_LINE) {
      json += ",\"lfL\":" + String(digitalRead(LF_IR_L) == LF_LINE_ACTIVE ? 1 : 0);
      json += ",\"lfC\":" + String(digitalRead(LF_IR_C) == LF_LINE_ACTIVE ? 1 : 0);
      json += ",\"lfR\":" + String(analogRead(LF_IR_R) > 2000 ? 1 : 0);
    } else if (carMode == MODE_LIGHT) {
      json += ",\"ldrL\":" + String(analogRead(LDR_L_PIN));
      json += ",\"ldrR\":" + String(analogRead(LDR_R_PIN));
    } else if (carMode == MODE_SOUND) {
      int rawMic = analogRead(MIC_PIN);
      json += ",\"sndAmp\":" + String(abs(rawMic - 2048));
      json += ",\"sndOn\":" + String(sndDriving ? 1 : 0);
    }
    json += "}";
    webSocket.broadcastTXT(json);
  }
  
  if (carMode == MODE_OA) {
    // ── Obstacle Avoidance (Autopilot Mode) ───────────────────
    long dC = distanceCM();
    int ir = analogRead(IR_PIN);
    lastDistance = dC;
    lastIR = ir;
    dC_dist = dC; // Update center distance for radar
    // Edge/cliff protection
    if (ir < IR_THRESHOLD) {
      stopAll(); beep(60);
      reverse(OA_REVERSE); delay(REVERSE_MS);
      int dir = chooseBestTurn();
      (dir > 0) ? pivotLeft(OA_TURN) : pivotRight(OA_TURN);
      delay(PIVOT_MS); stopAll();
      return;
    }
    // Ultrasonic collision avoidance
    if (dC <= SAFE_DIST_CM) {
      stopAll(); beep(60);
      reverse(OA_REVERSE); delay(REVERSE_MS); stopAll();
      int dir = chooseBestTurn();
      (dir > 0) ? pivotLeft(OA_TURN) : pivotRight(OA_TURN);
      delay(PIVOT_MS); stopAll();
    } else {
      int spd = (dC >= CLEAR_DIST_CM) ? OA_SPEED : OA_SPEED * 3 / 4;
      forward(spd);
    }
    delay(20);
  } else if (carMode == MODE_RC) {
    // ── RC Web Control Mode ──────────────────────────────────
    // Buzzer control
    digitalWrite(BUZZER, rcHornOn ? HIGH : LOW);
    // Apply motor drive commands
    applyRcCmd(rcCmd, rcSpeed);
    // Update telemetry parameters asynchronously in the background
    static unsigned long lastSensorUpdate = 0;
    if (millis() - lastSensorUpdate > 150) {
      lastSensorUpdate = millis();
      lastDistance = singlePingCM(15000UL); // Single ping with 15ms timeout (approx 250cm range)
      lastIR = analogRead(IR_PIN);
    }
    delay(15);
  } else if (carMode == MODE_GESTURE) {
    // ── Gesture Control Mode (Direct WS inputs control drive) ──
    // Buzzer control
    digitalWrite(BUZZER, rcHornOn ? HIGH : LOW);
    // Update telemetry parameters asynchronously in the background
    static unsigned long lastSensorUpdate = 0;
    if (millis() - lastSensorUpdate > 150) {
      lastSensorUpdate = millis();
      lastDistance = singlePingCM(15000UL);
      lastIR = analogRead(IR_PIN);
    }
    delay(15);
  } else if (carMode == MODE_FOLLOW) {
    // ── Human Following Mode ──────────────────────────────────
    unsigned long now = millis();
    if (now - lastFollowTime > 80) { // run logic at ~12Hz
      lastFollowTime = now;
      
      if (!followFound) {
        // Stop the car while searching
        stopAll();
        // Sweep search
        followAngle += followSweepDir;
        if (followAngle >= 135) {
          followAngle = 135;
          followSweepDir = -8;
        } else if (followAngle <= 45) {
          followAngle = 45;
          followSweepDir = 8;
        }
        aimServo(followAngle, false);
        
        long d = singlePingCM(15000UL); // 15ms timeout for quick scanning
        if (d >= 15 && d <= 50) {
          followFound = true;
          beep(50); // alert target found
          lostFollowTime = now;
        }
      } else {
        // Target is found. Check distance at current angle
        aimServo(followAngle, false);
        long d = singlePingCM(15000UL);
        lastDistance = d;
        
        if (d >= 15 && d <= 50) {
          lostFollowTime = now;
          dC_dist = d; // update for radar representation
          
          // Track and adjust servo angle by doing micro-scans
          aimServo(followAngle + 10, false);
          long dL_f = singlePingCM(15000UL);
          
          aimServo(followAngle - 10, false);
          long dR_f = singlePingCM(15000UL);
          
          // Return servo to target angle
          aimServo(followAngle, false);
          
          if (dL_f < d && dL_f < dR_f) {
            followAngle = constrain(followAngle + 6, 45, 135);
          } else if (dR_f < d && dR_f < dL_f) {
            followAngle = constrain(followAngle - 6, 45, 135);
          }
          
