Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
          // Control motor movements based on target servo position and distance
          if (followAngle > 102) {
            // Target is to the left, pivot left slowly
            pivotLeft(OA_TURN * 8 / 10);
          } else if (followAngle < 78) {
            // Target is to the right, pivot right slowly
            pivotRight(OA_TURN * 8 / 10);
          } else {
            // Target is centered, move forward/backward to maintain distance
            if (d > 30) {
              // Human moved away, follow
              forward(OA_SPEED);
            } else if (d < 20) {
              // Human is too close, back away
              reverse(OA_REVERSE);
            } else {
              // Sweet spot, stay put
              stopAll();
            }
          }
        } else {
          // Object out of range. Check if we've lost it for > 1.5 seconds
          stopAll();
          if (now - lostFollowTime > 1500) {
            followFound = false; // go back to sweeping search
            followAngle = TURN_ANGLE_C; // reset to center
          }
        }
      }
    }
  } else if (carMode == MODE_LINE) {
    // ── Line Following Mode ───────────────────────────────────
    bool lL = (digitalRead(LF_IR_L) == LF_LINE_ACTIVE);
    bool lC = (digitalRead(LF_IR_C) == LF_LINE_ACTIVE);
    bool lR = (analogRead(LF_IR_R) > 2000);  // threshold for input-only pin
    lastIR = analogRead(IR_PIN);
    if (lC && !lL && !lR) {
      // Center on line: go straight
      forward(LF_SPEED);
    } else if (lL && !lR) {
      // Line shifted left: steer left
      driveLeft(0); driveRight(LF_SPEED); // gentle arc left
    } else if (lR && !lL) {
      // Line shifted right: steer right
      driveLeft(LF_SPEED); driveRight(0);
    } else if (lL && lR) {
      // Both outer sensors see line: junction, keep going straight
      forward(LF_SPEED);
    } else {
      // Lost line: stop and wait
      stopAll();
    }
    delay(20);
  } else if (carMode == MODE_LIGHT) {
    // ── Light Control Mode ───────────────────────────────────
    int lA = analogRead(LDR_L_PIN);
    int lB = analogRead(LDR_R_PIN);
    int diff = lA - lB;
    lastIR = analogRead(IR_PIN);
    if (abs(diff) > LDR_DIFF_THRESH) {
      if (diff > 0) {
        // Left is brighter, steer left
        driveLeft(0); driveRight(LDR_TURN);
      } else {
        // Right is brighter, steer right
        driveLeft(LDR_TURN); driveRight(0);
      }
    } else {
      // Equal brightness: drive forward
      forward(LDR_SPEED);
    }
    delay(30);
  } else if (carMode == MODE_SOUND) {
    // ── Sound Control Mode ──────────────────────────────────
    int rawMic = analogRead(MIC_PIN);
    int amplitude = abs(rawMic - 2048);
    unsigned long now = millis();
    if (amplitude > SND_AMP_THRESH && now - lastSoundBeep > 600) {
      // Clap detected! Toggle drive state
      sndDriving = !sndDriving;
      lastSoundBeep = now;
      beep(40);
      if (sndDriving) { beep(40); } // double beep = ON, single beep = OFF
    }
    if (sndDriving) {
      forward(SND_SPEED);
    } else {
      stopAll();
    }
    delay(15);
  }
}
